cesartamarit/esp32-fw-showcase/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# BLE
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

# WiFi
CONFIG_ESP_WIFI_ENABLED=y
# BT+WiFi software coexistence (required to use both simultaneously)
CONFIG_ESP_COEX_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# OTA — custom 8MB partition table (two 2MB OTA slots)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# Allow HTTP URLs in addition to HTTPS (useful for local demo server)
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
# Mozilla CA bundle — validates GitHub / public HTTPS servers without embedding a cert
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Power management
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_POWER_MGR_DEEP_SLEEP_TIMEOUT_S=60
CONFIG_POWER_MGR_WAKE_GPIO=6

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Motors — set to y to enable servo + stepper (see OTA demo in README)
CONFIG_MOTORS_ENABLED=n
